update implementation details
